# Задача 3. В двумерном массиве хранятся средние дневные температуры с мая по сентябрь за прошлый год. 
# Каждому месяцу соответствует своя строка. 
# Определите самый жаркий и самый холодный 7-дневный промежуток этого периода. Выведите его даты.

sheetOfMonth = [[13, 9, 15, 12, 10, 22, 13, 9, 18, 19, 17, 21, 15, 19, 12, 13, 5, 15, 11, 11, 11, 17, 22, 18, 18, 15, 14, 7, 14, 17],
[23, 27, 30, 20, 14, 18, 24, 26, 26, 12, 15, 19, 20, 17, 20, 20, 27, 16, 27, 27, 14, 7, 17, 21, 17, 18, 18, 21, 19, 22],
[20, 23, 25, 27, 30, 31, 25, 19, 15, 23, 25, 27, 26, 29, 27, 24, 20, 23, 23, 22, 24, 27, 26, 28, 28, 30, 24, 17, 21, 23, 24],
[25, 23, 25, 24, 24, 24, 23, 23, 24, 24, 20, 25, 24, 17, 21, 23, 24, 23, 23, 16, 16, 18, 21, 20, 24, 24, 25, 26, 26, 27, 18],
[16, 15, 4, 17, 17, 17, 19, 19, 14, 13, 18, 18, 13, 11, 11, 10, 18, 20, 14, 9, 7, 6, 5, 5, 6, 9, 9, 7, 8, 13]]

sheetOfMonth = sum(sheetOfMonth, [])

opt = list(map(lambda a, b, c, d, e, f, g, x: (a + b + c + d + e + f + g, (a, b, c, d, e, f, g), x[0]+1), sheetOfMonth, sheetOfMonth[1:], sheetOfMonth[2:], sheetOfMonth[3:], sheetOfMonth[4:], sheetOfMonth[5:], sheetOfMonth[6:], enumerate(sheetOfMonth)))
max_sum_pair = max(opt)
min_sum_pair = min(opt)
print("-"*20)


if max_sum_pair[2] <= 31:
    print(f"Самый жаркий 7-дневный промежуток периода = {max_sum_pair[0]} градусов в сумме, его даты: c {max_sum_pair[2]}.05.2021 по {max_sum_pair[2] + 7}.05.2021")
elif (31 < max_sum_pair[2] <= 61):   
    print(f"Самый жаркий 7-дневный промежуток периода = {max_sum_pair[0]} градусов в сумме, его даты: c {max_sum_pair[2] - 31}.06.2021 по {max_sum_pair[2] - 31 + 7}.06.2021")
elif (61 < max_sum_pair[2] <= 92):   
    print(f"Самый жаркий 7-дневный промежуток периода = {max_sum_pair[0]} градусов в сумме, его даты: c {max_sum_pair[2] - 61}.07.2021 по {max_sum_pair[2] - 61 + 7}.07.2021")
elif (92 < max_sum_pair[2] <= 123):   
    print(f"Самый жаркий 7-дневный промежуток периода = {max_sum_pair[0]} градусов в сумме, его даты: c {max_sum_pair[2] - 92}.08.2021 по {max_sum_pair[2] - 92 + 7}.08.2021")
elif (123 < max_sum_pair[2] <= 153):   
    print(f"Самый жаркий 7-дневный промежуток периода = {max_sum_pair[0]} градусов в сумме, его даты: c {max_sum_pair[2] - 123}.09.2021 по {max_sum_pair[2] - 123 + 7}.09.2021")

if min_sum_pair[2] <= 31:
    print(f"Самый холодный 7-дневный промежуток периода = {min_sum_pair[0]} градусов в сумме, его даты: c {min_sum_pair[2]}.05.2021 по {min_sum_pair[2] + 7}.05.2021")
elif (31 < min_sum_pair[2] <= 61):   
    print(f"Самый холодный 7-дневный промежуток периода = {min_sum_pair[0]} градусов в сумме, его даты: c {min_sum_pair[2] - 31}.06.2021 по {min_sum_pair[2] - 31 + 7}.06.2021")
elif (61 < min_sum_pair[2] <= 92):   
    print(f"Самый холодный 7-дневный промежуток периода = {min_sum_pair[0]} градусов в сумме, его даты: c {min_sum_pair[2] - 61}.07.2021 по {min_sum_pair[2] - 61 + 7}.07.2021")
elif (92 < min_sum_pair[2] <= 123):   
    print(f"Самый холодный 7-дневный промежуток периода = {min_sum_pair[0]} градусов в сумме, его даты: c {min_sum_pair[2] - 92}.08.2021 по {min_sum_pair[2] - 92 + 7}.08.2021")
elif (123 < min_sum_pair[2] <= 153):   
    print(f"Самый холодный 7-дневный промежуток периода = {min_sum_pair[0]} градусов в сумме, его даты: c {min_sum_pair[2] - 123}.09.2021 по {min_sum_pair[2] - 123 + 7}.09.2021")    
